
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеИдентификатора();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИдентификаторПолученНажатие(Элемент)
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.Адрес) Тогда
		Сообщить("Не заполнен адрес сервера", СтатусСообщения.Важное);
		Отказ = Истина;		
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(Объект.Порт) Тогда
		Сообщить("Не заполнен порт сервера", СтатусСообщения.Важное);
		Отказ = Истина;		
	КонецЕсли;
	
	Если Не Отказ Тогда
		Объект.ИдентификаторКластера = КомандыУтилитыRAS.ПолучитьИдентификатор(Объект.Адрес, Объект.Порт);
		ОбновитьОтображениеИдентификатора()
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеИдентификатора()

	Если Не ЗначениеЗаполнено(Объект.ИдентификаторКластера) Тогда
		Элементы.ДекорацияИдентификаторПолучен.Заголовок = "<Получить идентификатор>";
		Элементы.ДекорацияИдентификаторПолучен.Доступность = Истина;	
	Иначе
		Элементы.ДекорацияИдентификаторПолучен.Заголовок = "Идентификатор получен";
		Элементы.ДекорацияИдентификаторПолучен.Доступность = Ложь;
	КонецЕсли;	
		
КонецПроцедуры


