
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеИдентификатора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьБазы_Отладка(Команда)
	
	КомандыУтилитыRAS.ПолучитьБазыКластера(Объект.Адрес, Объект.Порт);

КонецПроцедуры



&НаКлиенте
Процедура ОбновитьОтображениеИдентификатора()

	Если ЗначениеЗаполнено(Объект.ИдентификаторКластера) Тогда
		ИмяКомпьютера = КомандыУтилитыRAS.ПолучитьИмяКластера(Объект.Адрес, Объект.Порт);	
	КонецЕсли;	
		
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьИдентификатор(Команда)
	
	УстановитьИдентификатор(Параметры);	

КонецПроцедуры


&НаКлиенте
Процедура УстановитьИдентификатор(Параметры)
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.Адрес) Тогда
		Сообщить("Не заполнен адрес сервера", СтатусСообщения.Важное);
		Отказ = Истина;		
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(Объект.Порт) Тогда
		Сообщить("Не заполнен порт сервера", СтатусСообщения.Важное);
		Отказ = Истина;		
	КонецЕсли;
	
	Если Не Отказ Тогда
		Объект.ИдентификаторКластера = КомандыУтилитыRAS.ПолучитьИдентификаторКластера(Объект.Адрес, Объект.Порт);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторКластера) Тогда
		ПоказатьПредупреждение(, "Успешное подключение");
	Иначе
		ПоказатьПредупреждение(, "Не удалось подключиться");
	КонецЕсли;
	 	
КонецПроцедуры



&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.ИдентификаторКластера) Тогда
		УстановитьИдентификатор(Параметры);		
	КонецЕсли;

КонецПроцедуры


