

Функция ПолучитьИдентификатор(Адрес, Порт) Экспорт

#Если ВебКлиент Тогда
	Сообщить("Недопустимо использовать в Web-кленте");
	Возврат Неопределено;
#Иначе
	АдминистрированиеСервера = Новый АдминистрированиеСервера(Адрес, Порт);
	МассивАдминистраторов = АдминистрированиеСервера.ПолучитьАдминистраторов();
	
	Если МассивАдминистраторов.Количество() > 0 Тогда
		Сообщить("Необходимо указать АдминистратораКластера");	
		Возврат Неопределено;
	КонецЕсли;
	
	МассивКластеров = АдминистрированиеСервера.ПолучитьКластеры();
	Если МассивКластеров.Количество() = 1 Тогда
		Возврат МассивКластеров[0].ИдентификаторКластера;
	Иначе
		Возврат Неопределено;
	КонецЕсли;		  
#КонецЕсли

КонецФункции