
//#Если ВебКлиент Тогда
//	Сообщить("Недопустимо использовать в Web-клиенте");
//	Возврат Неопределено;
//#Иначе
//...
//#КонецЕсли


Функция ПолучитьИдентификаторКластера(Адрес, Порт) Экспорт

	ПараметрыКластера = ПолучитьКластерСервера(Адрес, Порт);
	
	Если ПараметрыКластера <> Неопределено Тогда
		Возврат ПараметрыКластера.ИдентификаторКластера;
	Иначе
		Возврат Неопределено;							
	КонецЕсли;
	
КонецФункции


Функция ПолучитьИмяКластера(Адрес, Порт) Экспорт
	
	ПараметрыКластера = ПолучитьКластерСервера(Адрес, Порт);
	
	Если ПараметрыКластера <> Неопределено Тогда
		Возврат ПараметрыКластера.ИмяКомпьютера;
	Иначе
		Возврат Неопределено;							
	КонецЕсли;
	
КонецФункции


//Функция ПолучитьКластерСервераПоИдентификатору(ИдентификаторКластера, Адрес, Порт) Экспорт
//
//	АдминистрированиеСервера = Новый АдминистрированиеСервера(Адрес, Порт);
//	
//	Если АдминистрированиеСервера <> Неопределено Тогда
//		Возврат АдминистрированиеСервера.ПолучитьКластер(ИдентификаторКластера);
//	Иначе
//		Возврат Неопределено;
//	КонецЕсли;
//
//КонецФункции


Функция ПолучитьБазыКластера(Адрес, Порт) Экспорт
	
	ПараметрыКластера = ПолучитьКластерСервера(Адрес, Порт);
	
	Если ПараметрыКластера <> Неопределено Тогда
		Возврат ПараметрыКластера.ПолучитьИнформационныеБазы();
	Иначе
		Возврат Неопределено;							
	КонецЕсли;	
	
КонецФункции


Функция ПолучитьКластерСервера(Адрес, Порт)	

	АгентСервера = Новый АдминистрированиеСервера(Адрес, Порт);
	
	//АгентСервера.ВыполнитьАутентификацию("Admin");
	
	МассивКластеров = АгентСервера.ПолучитьКластеры();
	Если МассивКластеров.Количество() = 1 Тогда
		
		ОсновнойКластер = МассивКластеров[0];
		ОсновнойКластер.ВыполнитьАутентификацию("Admin", );
		Возврат ОсновнойКластер;
	Иначе
		Возврат Неопределено;
	КонецЕсли;		  
	
КонецФункции

